lutaml/Concepts.dot
digraph G {
  graph [splines="ortho" pad=0.5 ranksep="1.2.equally" nodesep="1.2.equally"]
  edge [color="gray50"]
  node [shape="box" fontname="Helvetica-bold"]

  Definition [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER">«BasicDocument»</TD></TR>\n<TR><TD ALIGN="CENTER"><B>Definition</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  Concept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>Concept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+id : String &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+designations : Designation &#91;1..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+domain : «BasicDocument»LocalizedString &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+subject : «BasicDocument»LocalizedString &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+usageInfo : «BasicDocument»LocalizedString &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+definition : GlossaristDefinition &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+nonverbalrep : NonVerbRep &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+notes : GlossaristDefinition &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+examples : GlossaristDefinition &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+sources : ConceptSource &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+related : RelatedConcept &#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptSource [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptSource</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+status : ConceptSourceStatus</TD></TR>
            <TR><TD ALIGN="LEFT">+type : ConceptSourceType</TD></TR>
            <TR><TD ALIGN="LEFT">+origin : «Bibliography»Citation</TD></TR>
            <TR><TD ALIGN="LEFT">+modification : «BasicDocument»ParagraphBlock &#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  Designation [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>Designation</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  GlossaristDefinition [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>GlossaristDefinition</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+content : ParagraphBlock &#91;1..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+sources : ConceptSource &#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  NonVerbRep [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>NonVerbRep</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+image : «BasicDocument»Image &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+table : «BasicDocument»Table &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+formula : «BasicDocument»FormulaBlock &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+sources : ConceptSource &#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  RelatedConcept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>RelatedConcept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+type : RelatedConceptType</TD></TR>
            <TR><TD ALIGN="LEFT">+content : «BasicDocument»LocalizedString</TD></TR>
            <TR><TD ALIGN="LEFT">+ref : «StandardDocument»ReferenceToTermbase &#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptSourceStatus [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptSourceStatus</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">identical</TD></TR>
            <TR><TD ALIGN="LEFT">modified</TD></TR>
            <TR><TD ALIGN="LEFT">restyled</TD></TR>
            <TR><TD ALIGN="LEFT">context-added</TD></TR>
            <TR><TD ALIGN="LEFT">generalisation</TD></TR>
            <TR><TD ALIGN="LEFT">specialisation</TD></TR>
            <TR><TD ALIGN="LEFT">unspecified</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptSourceType [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptSourceType</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">authoritative</TD></TR>
            <TR><TD ALIGN="LEFT">lineage</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  RelatedConceptType [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>RelatedConceptType</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">deprecates</TD></TR>
            <TR><TD ALIGN="LEFT">supersedes</TD></TR>
            <TR><TD ALIGN="LEFT">narrower</TD></TR>
            <TR><TD ALIGN="LEFT">broader</TD></TR>
            <TR><TD ALIGN="LEFT">equivalent</TD></TR>
            <TR><TD ALIGN="LEFT">compare</TD></TR>
            <TR><TD ALIGN="LEFT">contrast</TD></TR>
            <TR><TD ALIGN="LEFT">see</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]

  ConceptSource -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  Definition -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  Designation -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  RelatedConcept -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  NonVerbRep -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  GlossaristDefinition -> Concept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  ConceptSourceStatus -> ConceptSource [dir="direct" arrowtail="onormal" arrowhead="vee"]
  ConceptSourceType -> ConceptSource [dir="direct" arrowtail="onormal" arrowhead="vee"]
  RelatedConceptType -> RelatedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
}
